RT32024TEST.ОбменМагистральБП/src/DataProcessors/МС_ВыгрузитьСчетНаОплатуПоставщика/МС_ВыгрузитьСчетНаОплатуПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МС_ВыгрузитьСчетНаОплатуПоставщика</name>
  <attributes>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧастьЗапасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураБП</name>
      <type>
        <types>CatalogRef.МС_НоменклатураБП</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

RT32024TEST.ОбменМагистральБП/src/Documents/СчетНаОплатуПоставщика/СчетНаОплатуПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c5463756-11fa-43bd-9f03-cc67ad6147ae">
  <name>СчетНаОплатуПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="cc899534-9172-4fc0-9dbc-d874343024c4">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9d49ba23-cc7f-4953-96a7-b5be0a3d7967">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf73bb6d-15ae-4c55-92a5-fc3e8939fe1b">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84755c43-855a-4600-96c6-fdfa2f9fd49f">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="65908bd4-32ee-4bdf-85a6-989856b7cf66">
    <name>СуммаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="923f77f3-e011-4b33-a9be-ff9ebc5e8573">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b1241df7-a45f-4d84-9ebd-b5bbce5fbb8b">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="019acb42-d09a-42b8-84d5-9a73cc37f25b">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="7fae79e4-9d95-4cbc-8f43-8262494ab49d">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f2491c22-e302-48a7-aa3f-0d91962bcee1">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="066ad5b2-00b9-4fcc-8b96-2f7a83dee1ce">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d78589b1-d531-44b8-8e66-39369bb2bdc4">
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="131576e5-bb16-48ff-a5ae-77083b515273">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fb89c40c-6c41-405d-869c-edb600cfbfb5">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="630fba5b-c9ba-45d3-9943-f18884994873">
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c1455aa-165b-454b-a01c-eb0411a40669">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

RT32024TEST.ОбменМагистральБП/src/DataProcessors/МС_ВыгрузитьСчетНаОплатуПоставщика/ObjectModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ОтправитьСчетНаОплатуПоставщика() Экспорт
	Данные = СформироватьJSON(Ссылка);
	СтрокаJSON = МС_ВыгрузкаСервер.ЗаписатьДанныеВJSON(Данные);
	ОтправитьJSONВБП(СтрокаJSON, Данные.guid);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьJSON(Знач Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СчетНаОплатуПоставщика.Ссылка) КАК ДокументГУИД,
		|	СчетНаОплатуПоставщика.Дата КАК Дата,
		|	СчетНаОплатуПоставщика.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
		|	СчетНаОплатуПоставщика.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
		|	СчетНаОплатуПоставщика.Комментарий КАК Комментарий,
		|	СчетНаОплатуПоставщика.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	СчетНаОплатуПоставщика.СуммаДокумента КАК СуммаДокумента,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СчетНаОплатуПоставщика.Организация) КАК ОрганизацияГУИД,
		|	СчетНаОплатуПоставщика.Организация.ИНН КАК ОрганизацияИНН,
		|	СчетНаОплатуПоставщика.Организация.КПП КАК ОрганизацияКПП,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СчетНаОплатуПоставщика.Контрагент) КАК КонтрагентГУИД,
		|	СчетНаОплатуПоставщика.Контрагент.ИНН КАК КонтрагентИНН,
		|	СчетНаОплатуПоставщика.Контрагент.КПП КАК КонтрагентКПП,
		|	СчетНаОплатуПоставщика.Контрагент.Наименование КАК КонтрагентНаименование,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СчетНаОплатуПоставщика.Договор) КАК ДоговорГУИД,
		|	СчетНаОплатуПоставщика.Договор.Наименование КАК ДоговорНаименование
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	СчетНаОплатуПоставщика.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(СчетНаОплатуПоставщика.Номенклатура) КАК НоменклатураГУИД,
		|	СчетНаОплатуПоставщика.Номенклатура.Наименование КАК Наименование,
		|	СчетНаОплатуПоставщика.Номенклатура.Артикул КАК Артикул,
		|	ПРЕДСТАВЛЕНИЕ(СчетНаОплатуПоставщика.Номенклатура.СтранаПроисхождения) КАК СтранаПроисхождения,
		|	ПРЕДСТАВЛЕНИЕ(СчетНаОплатуПоставщика.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
		|	СчетНаОплатуПоставщика.Номенклатура.МС_НоменклатураБП.СсылкаВДругойИБ КАК НоменклатураБПГУИД,
		|	СчетНаОплатуПоставщика.Количество КАК Количество,
		|	СчетНаОплатуПоставщика.Всего КАК Всего,
		|	СчетНаОплатуПоставщика.Цена КАК Цена,
		|	СчетНаОплатуПоставщика.Сумма КАК Сумма,
		|	ПРЕДСТАВЛЕНИЕ(СчетНаОплатуПоставщика.СтавкаНДС) КАК СтавкаНДС,
		|	СчетНаОплатуПоставщика.СуммаНДС КАК СуммаНДС
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика.Запасы КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	СчетНаОплатуПоставщика.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Шапка = РезультатЗапроса[0].Выбрать();
	
	Шапка.Следующий();
	
	Данные = Новый Структура;
	
	//Реквизиты шапки документа
	Данные.Вставить("source", "СчетНаОплатуПоставщика");
	Данные.Вставить("guid", XMLСтрока(Шапка.ДокументГУИД));
	Данные.Вставить("date", XMLСтрока(Шапка.Дата));
	Данные.Вставить("incoming_number", Шапка.НомерВходящегоДокумента);
	Данные.Вставить("incoming_date", XMLСтрока(Шапка.ДатаВходящегоДокумента));
	Данные.Вставить("comment", Шапка.Комментарий);
	Данные.Вставить("amount_includes_vat", Шапка.СуммаВключаетНДС);
	Данные.Вставить("total_amount", Шапка.СуммаДокумента);
	
	Организация = Новый Структура;
	Организация.Вставить("guid", XMLСтрока(Шапка.ОрганизацияГУИД));
	Организация.Вставить("inn", Шапка.ОрганизацияИНН);
	Организация.Вставить("kpp", Шапка.ОрганизацияКПП);
	Данные.Вставить("organization", Организация);
	
	Контрагент = Новый Структура;
	Контрагент.Вставить("guid", XMLСтрока(Шапка.КонтрагентГУИД));
	Контрагент.Вставить("inn", Шапка.КонтрагентИНН);
	Контрагент.Вставить("kpp", Шапка.КонтрагентКПП);
	Контрагент.Вставить("name", Шапка.КонтрагентНаименование);
	Данные.Вставить("Counterparty", Контрагент);
	
	ДоговорКонтрагент = Новый Структура;
	ДоговорКонтрагент.Вставить("guid", XMLСтрока(Шапка.ДоговорГУИД));
	ДоговорКонтрагент.Вставить("name", Шапка.ДоговорНаименование);
	Данные.Вставить("Counterparty_agreement", ДоговорКонтрагент);
	

	//Реквизиты табличной части документа
	СтрокаЗапасы = РезультатЗапроса[1].Выбрать();
	Запасы = Новый Массив; //Массив из структур
	
	Пока СтрокаЗапасы.Следующий() Цикл
		
		НоменклатураJSON = Новый Структура;
		НоменклатураJSON.Вставить("guid", XMLСтрока(СтрокаЗапасы.НоменклатураГУИД));
		НоменклатураJSON.Вставить("name", СтрокаЗапасы.Наименование);
		НоменклатураJSON.Вставить("article", СтрокаЗапасы.Артикул);
		НоменклатураJSON.Вставить("Country", СтрокаЗапасы.СтранаПроисхождения);
		НоменклатураJSON.Вставить("unit", СтрокаЗапасы.ЕдиницаИзмерения);
		НоменклатураJSON.Вставить("guid_bp", СтрокаЗапасы.НоменклатураБПГУИД);
		
		СтрокаJSON = Новый Структура;
		СтрокаJSON.Вставить("Nomenclature", НоменклатураJSON);
		СтрокаJSON.Вставить("quantity", СтрокаЗапасы.Количество);
		СтрокаJSON.Вставить("price", СтрокаЗапасы.Цена);
		СтрокаJSON.Вставить("amount", СтрокаЗапасы.Сумма);
		СтрокаJSON.Вставить("vat_rate", СтрокаЗапасы.СтавкаНДС);
		СтрокаJSON.Вставить("vat_amount", СтрокаЗапасы.СуммаНДС);
		СтрокаJSON.Вставить("total", СтрокаЗапасы.Всего);
		
		Запасы.Добавить(СтрокаJSON);
		
	КонецЦикла;
	
	Данные.Вставить("items", Запасы);
	
	Возврат Данные;
	
КонецФункции

Функция ОтправитьJSONВБП(СтрокаJSON, GUIDДокументаИсточник = "")
	
	Сервер = СокрЛП(Строка(Константы.МС_АдресБП.Получить()));
	Порт = Константы.МС_ПортБП.Получить();
	Пользователь = СокрЛП(Строка(Константы.МС_ПользовательБП.Получить()));
	Пароль = Строка(Константы.МС_ПарольБП.Получить());
	
	ПутьHTTPСервиса = СокрЛП(Строка(Константы.МС_ПутьHTTPСервисаБП.Получить()));
	Таймаут = Константы.МС_ТаймаутHTTPБП.Получить();
	
	Если ПустаяСтрока(Сервер) Или ПустаяСтрока(ПутьHTTPСервиса) Тогда
		ВызватьИсключение "Не заполнены настройки обмена с БП (адрес/путь HTTP-сервиса).";
	КонецЕсли;
	
	Если Порт = Неопределено Или Порт = 0 Тогда
		Порт = 80;
	КонецЕсли;
	
	Если Таймаут = Неопределено Или Таймаут <= 0 Тогда
		Таймаут = 60;
	КонецЕсли;
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
			Сервер,
			Порт,
			Пользователь,
			Пароль,
			,
			Таймаут,
			
		);
	
		Запрос = Новый HTTPЗапрос(ПутьHTTPСервиса);
		Запрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Запрос.Заголовки.Вставить("Accept", "application/json");
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
		Если Ответ.КодСостояния = 200 Тогда
		//@skip-check undefined-variable
		ОтветСтруктура = МС_ВыгрузкаСервер.ПрочитатьJSONИзСтроки(ТелоОтвета);
		
			Текст = СтрШаблон("Документ успешно загружен в бухгалтерию: %1", ОтветСтруктура.document_ref);
		
			//@skip-check undefined-variable
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
			//@skip-check undefined-variable
			ОбщегоНазначения.СообщитьПользователю(ОтветСтруктура.ref);
			
			//@skip-check undefined-variable
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
				"МС_ОбменРозницаБП",
				УровеньЖурналаРегистрации.Информация,
				,
				,
				"Успешная выгрузка в БП (GUID=" + GUIDДокументаИсточник + ", БП.Ссылка=" + Строка(ОтветСтруктура.document_ref) + ")."
			);
		Иначе
		
			ВызватьИсключение 
				"Ошибка HTTP при выгрузке в Бухгалтерию. Код: "
				+ Строка(Ответ.КодСостояния)
				+ ". Ответ: "
				+ ТелоОтвета;
			
		КонецЕсли;
	
		Возврат ТелоОтвета;
		
	Исключение
		
		ТекстОшибки = "Ошибка обмена с БП";
		Если Не ПустаяСтрока(GUIDДокументаИсточник) Тогда
			ТекстОшибки = ТекстОшибки + " (GUID=" + GUIDДокументаИсточник + ")";
		КонецЕсли;
		ТекстОшибки = ТекстОшибки + ": " + ОписаниеОшибки();
		
		//@skip-check undefined-variable
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"МС_ОбменРозницаБП",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ТекстОшибки
		);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецФункции


#КонецОбласти
